#from config import devices

conf_devices = {

    "Xiaomi11SPro":{

        "iptBox_x":495,
        "iptBox_y":3033,
        "sendBtn_x":1300,
        "sendBtn_y":2800,
        # 自动语音输入弹出后发送按钮的位置改变
        "sendBtn_xAddition":1340,
        "sendBtn_yAddition":690,
        # 空白处的x坐标位置，确保卡壳的时候输入框能正确收回
        "sendBtn_xOther":225
    },

    "RedmiNote12":{

        "iptBox_x":385,
        "iptBox_y":2275,
        "sendBtn_x":980,
        "sendBtn_y":2098,
        # 自动语音输入弹出后发送按钮的位置改变
        "sendBtn_xAddition":225,
        "sendBtn_yAddition":690,
        # 空白处的x坐标位置，确保卡壳的时候输入框能正确收回
        "sendBtn_xOther":225
    },

    "VivoY30":{

        "iptBox_x":227,
        "iptBox_y":1437,
        "sendBtn_x":670,
        "sendBtn_y":1438,
        # 自动语音输入弹出后发送按钮的位置改变
        "sendBtn_xAddition":125,
        "sendBtn_yAddition":378,
        # 空白处的x坐标位置，确保卡壳的时候输入框能正确收回
        "sendBtn_xOther":125
    },

    "HUAWEIMate9Pro":{

        "iptBox_x":390,
        "iptBox_y":2400,
        "sendBtn_x":1282,
        "sendBtn_y":2194,
        # 自动语音输入弹出后发送按钮的位置改变
        "sendBtn_xAddition":220,
        "sendBtn_yAddition":475,
        # 空白处的x坐标位置，确保卡壳的时候输入框能正确收回
        "sendBtn_xOther":220
    },

    "PORSCHEMate20":{

        "iptBox_x":455,
        "iptBox_y":2200,
        "sendBtn_x":969,
        "sendBtn_y":2070,
        # 自动语音输入弹出后发送按钮的位置改变
        "sendBtn_xAddition":220,
        "sendBtn_yAddition":475,
        # 空白处的x坐标位置，确保卡壳的时候输入框能正确收回
        "sendBtn_xOther":220
    },
}

conf_default_device = "RedmiNote12"
conf_default_device_id = "b4a4ae850722"

conf_message_list = [
    "真诚交友，真诚交友，真诚交友，真诚交友，真诚交友，真诚交友，真诚交友，真诚交友，真诚交友。",
    "主播辛苦了，真诚交友，真诚交友，真诚交友。。。",
    "交朋友！交朋友！交朋友！",
    "喜欢主播的风格，感谢有这样的直播间互通有无，诚心交朋友",
    "庆幸能在这样的地方和朋友们相识相遇，互帮互助，关注好友",
    "诚意交朋友，主播666，主播666，感恩相识，共同进步。",
    "直播辛苦，努力有价值，成长有同伴，温暖有直播间~~~ 一路畅行",
    "感谢朋友们今天的陪伴，感谢所有进入这里相互交流的大家，谢谢关注，谢谢主播，今天很开心！",
    "支持主播，诚意交友，直播间老铁，热情弹幕刷起来~~~666~~~999，感谢主播气氛带动",
    "666 666 666 666 666 666 666 666",
    "[玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰]",
    "[加油][加油][加油][加油][加油][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][加油][加油]",
    "[比心][比心][比心][比心][比心][比心][赞][赞][赞][赞][赞][赞][加油][加油][加油][玫瑰]",
    "[赞][赞][赞][赞][赞][赞][加油][加油][加油][比心][比心][比心]",
    "交朋友，交朋友 交朋友，交朋友 交朋友，交朋友 交朋友，交朋友 交朋友，交朋友",
    "[玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰]",
    "[加油][加油][加油][加油][加油][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][玫瑰][加油][加油]",
    "[比心][比心][比心][比心][比心][比心][赞][赞][赞][赞][赞][赞][加油][加油][加油][玫瑰]",
    "[赞][赞][赞][赞][赞][赞][加油][加油][加油][比心][比心][比心]",
    "交朋友，交朋友 交朋友，交朋友 交朋友，交朋友 交朋友，交朋友 交朋友，交朋友",
    "正能量 主播赞 [赞][赞][赞] 正能量 主播赞 [赞][赞][赞] 正能量 主播赞 [赞][赞][赞]",
    "[加油][加油]小手拉起来，互动起来，小手拉起来，互动起来[加油][加油]",
    #"只要快递还在路上，生活就充满了希望。只要抖音直播还在，成长就有目标。",
    #"鞠躬君子 胸怀何坦荡; 疾风知劲草 世乱鉴忠良; 沧浪水浊兮 以吾心濯沧浪; 千载犹闻侠骨香...",
    #"像女孩子这种可爱的生物，当然要宠着",
    #"我不能逛街，一逛街发现自己什么都缺，不如刷刷直播间。。。",
    #"我们什么都没有，唯一的本钱就是青春",
    #"虽不能感同身受，但愿做你的最佳听众",
    #"我相信，路总会有平坦的一面",
    #"愿有人与你立黄昏，愿有人问你粥可温",
    #"倘不奋发，唯有失败，顾影自怜",
    #"我越努力越幸运,大家越努力也越幸运",
    #"一路上有你，呆一点也愿意。缘分让你我在此相聚",
    #"你༗若༗盛༗开༗，清༗风༗自༗来༗",
    #"直至生死入眼帘，方知情字乃是贪",
    #"亦余心之所善兮，虽九死其犹未悔",
    #"外面的世界很精彩，请勇敢飞出来~~~~~~~~~~",
    #"路的尽头，仍然是路，只要你愿意走，并不完美，但却自由~~~",
    #"随遇而安，便会花开四季，明媚嫣然，加油加油",
    #"抖音新号扶持，涨粉互暖，有关必回，共同加油！",
    #"玉屏风冷愁人。醉烂漫、梅花翠云",
    #"愿你可以找到那个与你长期共振，可以相互诉说废话的人",
    #"凡事预则立，不预则废，待你强大，你给自己天下",
    #"在没人喝彩的时候我们要学会给自己喝彩，在没人鼓掌的时候我们要学会给自己鼓掌",
    #"一份信心，一份成功，一份努力；十分信心，十分成功，十分努力。",
    #"人生像攀登一座山，而找寻出路，却是一种学习的过程，我们应当在这过程中，学习稳定、冷静，学习如何从慌乱中找到生机。",
    #"记住：你是你生命的船长，走自己的路，何必在乎其它。",
    #"莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。",
    #"主播我来了，感知正能量！",
    #"关注主播不迷路，主播带你上高速！谢谢主播带队互动！！感谢提供交友平台！！！",
    #"大家好，我是新人，特来向大家学习，希望大家混个眼熟，常互动哟~~~~",
    #"相见是缘分，相交更是缘分，虽然不知道你何时出现，不如借主播的这方热土，先行动起来。热情点赞，友情互关！",
    #"诚信交友，有关必回！共同成长，有幸有你！诚信交友，有关必回！共同成长，有幸有你！",
]